docs.org/ENDE/Notas/index.org
#+TITLE: ENDE - Notas
#+SETUPFILE: ~/Archive/Templates/Org/common-data-es-classes.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../css/index.css" />
* TEMA 1
** Conceptos de software, programa y aplicacion.
*** Software
- Tambien denominado componente logico.
- Es intangible, a diferencia del hardware que es tangible.
- Realiza una tarea determinada.
- Se comunica con el hardware para llevar a cabo su tarea.
- Se desarrolla, no se fabrica.
- Incluye los datos utilizados por los programas.
- Puede ser a medida o enlatado.
**** Categorias
***** Segun el tipo de tarea que realiza
****** De sistema
- Hace que funcione el HW.
- Administra los recursos HW.
- Intermediario: Humano - HW.
- Ejemplo: SS. OO., Controladores (driver)
****** De aplicacion
- Nos ayudan a realizar tareas especificas -> automatizan.
- Ejemplo: CAD, SW medico, contabilidad, ofimatica, ...
****** De programacion o Desarrollo
- Proporciona herramientas al progamador.
- Suelen contar con un IDE (Entornos de Desarrollo Integrados).
- Ejemplos: Eclipse.
***** Segun el metodo de distribucion
****** Shareware
- El usuario evalua el producto el producto por tiempo determinado.
- Adquirir su licencia -> $ | Precio cero
- Ejemplo: Winrar
****** Freeware
- Se distribuye sin $.
- Incluye una licencia:
- Permite su redistrubacion.
- Restricciones: vender, modificar.
- No es software de libre distribucion.
****** Adware
- Shareware + se descarga automaticamente + publicidad.
- Al comprar la licencia -> desaparece la publicidad.
****** Multimedia
- Integra textos, graficos, sonidos, animaciones.
- En distintos ambitos como el educativo.
****** De uso especifico
- Resuelven un problema concreto.
- Ejemplo: bancos, educacion, ...
**** Licencias
- Licencia = contrato (desarrollador del SW, usuario).
***** SW Libre
- Utilizado con cualquier fin.
- Podemos estudiar su funcionamiento y modificarlo.
- Distribuir copias.
- Mejoras -> hacerlas publicas -> distribuir al publico.
***** SW Propietario
- El codigo fuente no es accesible.
- Su licencia prohibe 1 o varias posibilidades:
  - Redistribucion.
  - Copia.
  - Uso en varias maquinas.
  - Transferencias de titularidad.
  - Difusion de fallos y errores.
  - Variantes: Freeware y Shareware.
***** SW de dominio publico
- So desconoce su autor o fin de la propiedad de autor.
***** GPL
- Licencia mas utilizada.
- SW Libre + fuente abierta.
- Derecho a: usar, modificar haciendo publicas.
**** Tipos
***** A medida
- Adaptado a los requeremientos de la empresa u organizacion.
- Se desarrollo en funcion de las necesidades, actividad y
  forma de trabajar.
- No suele ser compatible con empresas del sector.
- Es mas costoso, ya que va dirigido a un solo cliente.
- Necesito tiempo de desarrollo.
***** Estandar o Enlatados
- Es software generico.
- Resuelve multiples necesidades.
- Puede parametrizarse o adaptarse a las necesiades ->
  herramientas de configuracion.
- Pueden faltarse funciones -> se complementa con otras
  herramientas.
- Ya esta hecho.
- Menor numero de errores -> comprobado por varios clientes.
- Suele ser mas barato.
- Pueden tener funciones que no usamos.
**** Ciclos de vida
- Son las fases o etapas en las que se desarrolla el software.
***** Cascada
- Entrega el documento completo.
- Solo en el mantenimiento se vuelve a etapas anteriores
  (codificacion -> pruebas).
- Con realimentacion:
  - Cuando debido a un fallo, ambiguedades, etc ... se vuelve
    a etapas anteriores.
- Ventajas, inconvenientes. Cuando se recomienda.
***** Evolutivos
- Los requisitos del usuario y del producto cambian cuando se
  desarrolla.
- Surgen versiones distintas.
****** Iterativo incremental
- Basado en cascada.
- El SW se entrega en partes pequeñas -> incrementos.
- Los incrementos son reutilizables.
- Ej: procesador de textos.
  - Primero se desarrollan las funciones basicas como las de
    edicion.
  - En cada incremento se desarrollarian nuevas funciones como
    la gramatica u ortografia.
  - En el siguiente, funciones avanzadas de paginacion.
  - ...      
****** En espiral
- Mezcla el modelo en Cascada y el iterativo de construccion
 de prototipos. 
- Cada ciclo -> se divide en 4 fases.
- Es similar al iterativo incremental, pero este si analiza
 riesgos. 
- Fases:
  - Determinar objetivos, alternativas, restricciones, ...
  - Analisis de riesgos: identificar los riesgos, como
    resolverlos, ...
  - Desarrollar y probar.
  - Planificacion: se revisa lo hecho, si se continua, se
    planifican las fases del ciclo siguiente.      
- Muy utilizado para sistemas orientados a objetos.
