ENDE/Notas/index.html
<!DOCTYPE html>
<html lang="es">
<head>
<!-- 2022-05-11 Wed 11:07 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ENDE - Notas</title>
<meta name="author" content="Alberto Robles Gomez" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../css/index.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">ENDE - Notas</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>&Iacute;ndice</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga37d3eb">TEMA 1</a>
<ul>
<li><a href="#org3f1942f">Conceptos de software, programa y aplicacion.</a>
<ul>
<li><a href="#org72fc0b5">Software</a></li>
<li><a href="#org7677221">Programa</a></li>
<li><a href="#orgf8660a1">Aplicacion</a></li>
<li><a href="#org497f8c2">Suite o Paquete Integrado</a></li>
</ul>
</li>
<li><a href="#orgcc6d088">Lenguajes de programacion</a>
<ul>
<li><a href="#orgda6befb">Componentes</a></li>
<li><a href="#org2f20220">Criterios para establecer las clasificaciones</a></li>
<li><a href="#orgad712ff">Obtener codigo ejecutable</a></li>
</ul>
</li>
<li><a href="#org2744220">Maquinas Virtuales</a>
<ul>
<li><a href="#org5253eee">Categorias</a></li>
<li><a href="#org5e1019d">La maquina virtual de Java</a></li>
</ul>
</li>
<li><a href="#org16b346c">Lenguajes mas difundidos. Caracteristicas.</a>
<ul>
<li><a href="#orgeabd3b0">Java</a></li>
<li><a href="#org63abca3">Python</a></li>
<li><a href="#orga1fec64">C y C++</a></li>
<li><a href="#org93e4c7b">JavaScript</a></li>
<li><a href="#org7f5cee4">PHP</a></li>
<li><a href="#orgee8143a">VB.NET</a></li>
</ul>
</li>
<li><a href="#org30eeaa9">Desarrollo de una aplicacion</a>
<ul>
<li><a href="#org1894de7">Fases</a></li>
<li><a href="#org3f43410">Roles en el desarrollo de software</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdf9bb47">TEMA 2</a></li>
</ul>
</div>
</nav>

<div id="outline-container-orga37d3eb" class="outline-2">
<h2 id="orga37d3eb">TEMA 1</h2>
<div class="outline-text-2" id="text-orga37d3eb">
</div>
<div id="outline-container-org3f1942f" class="outline-3">
<h3 id="org3f1942f">Conceptos de software, programa y aplicacion.</h3>
<div class="outline-text-3" id="text-org3f1942f">
</div>
<div id="outline-container-org72fc0b5" class="outline-4">
<h4 id="org72fc0b5">Software</h4>
<div class="outline-text-4" id="text-org72fc0b5">
<ul class="org-ul">
<li>Tambien denominado componente logico.</li>
<li>Es intangible, a diferencia del hardware que es tangible.</li>
<li>Realiza una tarea determinada.</li>
<li>Se comunica con el hardware para llevar a cabo su tarea.</li>
<li>Se desarrolla, no se fabrica.</li>
<li>Incluye los datos utilizados por los programas.</li>
<li>Puede ser a medida o enlatado.</li>
</ul>
</div>

<div id="outline-container-org9114276" class="outline-5">
<h5 id="org9114276">Categorias</h5>
<div class="outline-text-5" id="text-org9114276">
</div>
<div id="outline-container-org25523db" class="outline-6">
<h6 id="org25523db">Segun el tipo de tarea que realiza</h6>
<div class="outline-text-6" id="text-org25523db">
</div>
<div id="outline-container-org984d567" class="outline-7">
<h7 id="org984d567">De sistema</h7>
<div class="outline-text-7" id="text-org984d567">
<ul class="org-ul">
<li>Hace que funcione el HW.</li>
<li>Administra los recursos HW.</li>
<li>Intermediario: Humano - HW.</li>
<li>Ejemplo: SS. OO., Controladores (driver)</li>
</ul>
</div>
</div>

<div id="outline-container-org2ae385f" class="outline-7">
<h7 id="org2ae385f">De aplicacion</h7>
<div class="outline-text-7" id="text-org2ae385f">
<ul class="org-ul">
<li>Nos ayudan a realizar tareas especificas -&gt; automatizan.</li>
<li>Ejemplo: CAD, SW medico, contabilidad, ofimatica, &#x2026;</li>
</ul>
</div>
</div>

<div id="outline-container-orgad568b3" class="outline-7">
<h7 id="orgad568b3">De programacion o Desarrollo</h7>
<div class="outline-text-7" id="text-orgad568b3">
<ul class="org-ul">
<li>Proporciona herramientas al progamador.</li>
<li>Suelen contar con un IDE (Entornos de Desarrollo Integrados).</li>
<li>Ejemplos: Eclipse.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgde4a5c5" class="outline-6">
<h6 id="orgde4a5c5">Segun el metodo de distribucion</h6>
<div class="outline-text-6" id="text-orgde4a5c5">
</div>
<div id="outline-container-org296d22b" class="outline-7">
<h7 id="org296d22b">Shareware</h7>
<div class="outline-text-7" id="text-org296d22b">
<ul class="org-ul">
<li>El usuario evalua el producto el producto por tiempo determinado.</li>
<li>Adquirir su licencia -&gt; $ | Precio cero</li>
<li>Ejemplo: Winrar</li>
</ul>
</div>
</div>

<div id="outline-container-org938886f" class="outline-7">
<h7 id="org938886f">Freeware</h7>
<div class="outline-text-7" id="text-org938886f">
<ul class="org-ul">
<li>Se distribuye sin $.</li>
<li>Incluye una licencia:</li>
<li>Permite su redistrubacion.</li>
<li>Restricciones: vender, modificar.</li>
<li>No es software de libre distribucion.</li>
</ul>
</div>
</div>

<div id="outline-container-org206b245" class="outline-7">
<h7 id="org206b245">Adware</h7>
<div class="outline-text-7" id="text-org206b245">
<ul class="org-ul">
<li>Shareware + se descarga automaticamente + publicidad.</li>
<li>Al comprar la licencia -&gt; desaparece la publicidad.</li>
</ul>
</div>
</div>

<div id="outline-container-org0eff81d" class="outline-7">
<h7 id="org0eff81d">Multimedia</h7>
<div class="outline-text-7" id="text-org0eff81d">
<ul class="org-ul">
<li>Integra textos, graficos, sonidos, animaciones.</li>
<li>En distintos ambitos como el educativo.</li>
</ul>
</div>
</div>

<div id="outline-container-org41872ab" class="outline-7">
<h7 id="org41872ab">De uso especifico</h7>
<div class="outline-text-7" id="text-org41872ab">
<ul class="org-ul">
<li>Resuelven un problema concreto.</li>
<li>Ejemplo: bancos, educacion, &#x2026;</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf1f6b41" class="outline-5">
<h5 id="orgf1f6b41">Licencias</h5>
<div class="outline-text-5" id="text-orgf1f6b41">
<ul class="org-ul">
<li>Licencia = contrato (desarrollador del SW, usuario).</li>
</ul>
</div>

<div id="outline-container-org4d24580" class="outline-6">
<h6 id="org4d24580">SW Libre</h6>
<div class="outline-text-6" id="text-org4d24580">
<ul class="org-ul">
<li>Utilizado con cualquier fin.</li>
<li>Podemos estudiar su funcionamiento y modificarlo.</li>
<li>Distribuir copias.</li>
<li>Mejoras -&gt; hacerlas publicas -&gt; distribuir al publico.</li>
</ul>
</div>
</div>

<div id="outline-container-org2e36896" class="outline-6">
<h6 id="org2e36896">SW Propietario</h6>
<div class="outline-text-6" id="text-org2e36896">
<ul class="org-ul">
<li>El codigo fuente no es accesible.</li>
<li>Su licencia prohibe 1 o varias posibilidades:
<ul class="org-ul">
<li>Redistribucion.</li>
<li>Copia.</li>
<li>Uso en varias maquinas.</li>
<li>Transferencias de titularidad.</li>
<li>Difusion de fallos y errores.</li>
<li>Variantes: Freeware y Shareware.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org93cd220" class="outline-6">
<h6 id="org93cd220">SW de dominio publico</h6>
<div class="outline-text-6" id="text-org93cd220">
<ul class="org-ul">
<li>So desconoce su autor o fin de la propiedad de autor.</li>
</ul>
</div>
</div>

<div id="outline-container-org5b265ca" class="outline-6">
<h6 id="org5b265ca">GPL</h6>
<div class="outline-text-6" id="text-org5b265ca">
<ul class="org-ul">
<li>Licencia mas utilizada.</li>
<li>SW Libre + fuente abierta.</li>
<li>Derecho a: usar, modificar haciendo publicas.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb8170c9" class="outline-5">
<h5 id="orgb8170c9">Tipos</h5>
<div class="outline-text-5" id="text-orgb8170c9">
</div>
<div id="outline-container-org7904fd1" class="outline-6">
<h6 id="org7904fd1">A medida</h6>
<div class="outline-text-6" id="text-org7904fd1">
<ul class="org-ul">
<li>Adaptado a los requeremientos de la empresa u organizacion.</li>
<li>Se desarrollo en funcion de las necesidades, actividad y
forma de trabajar.</li>
<li>No suele ser compatible con empresas del sector.</li>
<li>Es mas costoso, ya que va dirigido a un solo cliente.</li>
<li>Necesito tiempo de desarrollo.</li>
</ul>
</div>
</div>

<div id="outline-container-org65c8a8a" class="outline-6">
<h6 id="org65c8a8a">Estandar o Enlatados</h6>
<div class="outline-text-6" id="text-org65c8a8a">
<ul class="org-ul">
<li>Es software generico.</li>
<li>Resuelve multiples necesidades.</li>
<li>Puede parametrizarse o adaptarse a las necesiades -&gt;
herramientas de configuracion.</li>
<li>Pueden faltarse funciones -&gt; se complementa con otras
herramientas.</li>
<li>Ya esta hecho.</li>
<li>Menor numero de errores -&gt; comprobado por varios clientes.</li>
<li>Suele ser mas barato.</li>
<li>Pueden tener funciones que no usamos.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb065ab6" class="outline-5">
<h5 id="orgb065ab6">Ciclos de vida</h5>
<div class="outline-text-5" id="text-orgb065ab6">
<ul class="org-ul">
<li>Son las fases o etapas en las que se desarrolla el software.</li>
</ul>
</div>

<div id="outline-container-org1dc3a2c" class="outline-6">
<h6 id="org1dc3a2c">Cascada</h6>
<div class="outline-text-6" id="text-org1dc3a2c">
<ul class="org-ul">
<li>Entrega el documento completo.</li>
<li>Solo en el mantenimiento se vuelve a etapas anteriores
(codificacion -&gt; pruebas).</li>
<li>Con realimentacion:
<ul class="org-ul">
<li>Cuando debido a un fallo, ambiguedades, etc &#x2026; se vuelve
a etapas anteriores.</li>
</ul></li>
<li>Ventajas, inconvenientes. Cuando se recomienda.</li>
</ul>
</div>
</div>

<div id="outline-container-orgee2c8e8" class="outline-6">
<h6 id="orgee2c8e8">Evolutivos</h6>
<div class="outline-text-6" id="text-orgee2c8e8">
<ul class="org-ul">
<li>Los requisitos del usuario y del producto cambian cuando se
desarrolla.</li>
<li>Surgen versiones distintas.</li>
</ul>
</div>

<div id="outline-container-orgced8944" class="outline-7">
<h7 id="orgced8944">Iterativo incremental</h7>
<div class="outline-text-7" id="text-orgced8944">
<ul class="org-ul">
<li>Basado en cascada.</li>
<li>El SW se entrega en partes pequeñas -&gt; incrementos.</li>
<li>Los incrementos son reutilizables.</li>
<li>Ej: procesador de textos.
<ul class="org-ul">
<li>Primero se desarrollan las funciones basicas como las de
edicion.</li>
<li>En cada incremento se desarrollarian nuevas funciones como
la gramatica u ortografia.</li>
<li>En el siguiente, funciones avanzadas de paginacion.</li>
<li>&#x2026;</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge6449dc" class="outline-7">
<h7 id="orge6449dc">En espiral</h7>
<div class="outline-text-7" id="text-orge6449dc">
<ul class="org-ul">
<li>Mezcla el modelo en Cascada y el iterativo de construccion
de prototipos.</li>
<li>Cada ciclo -&gt; se divide en 4 fases.</li>
<li>Es similar al iterativo incremental, pero este si analiza
riesgos.</li>
<li>Fases:
<ul class="org-ul">
<li>Determinar objetivos, alternativas, restricciones, &#x2026;</li>
<li>Analisis de riesgos: identificar los riesgos, como
resolverlos, &#x2026;</li>
<li>Desarrollar y probar.</li>
<li>Planificacion: se revisa lo hecho, si se continua, se
planifican las fases del ciclo siguiente.</li>
</ul></li>
<li>Muy utilizado para sistemas orientados a objetos.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
