docs.org/ENDE/Notas/index.org
*** Programa
- Es una serie de ordenes o instrucciones.
- Siguen un orden o secuencia para cumplir una finalidad determinado.
- Ejemplo: Holamundo.c
*** Aplicacion
- Puede estar formada por uno o varios programas.
- Esta en contacto con el usuario, no con el hardware.
- Ejemplo: BB.DD., procesadores do texto, hojas de calculo, correo electronico.
- Finalizar: automatizar o ayudar a realizar tareas.
*** Suite o Paquete Integrado
- Es el conjunto de programas que se ejecutan unos
  independientes del otro.
- Ejemplo: Microsoft Office, Libre Office, Open Office.
- Suelen compartir elementos comunes como librerias, datos. etc.
- Son compatibles entre ellos.
** Lenguajes de programacion
- Los programas son conjuntos de instrucciones que se desarrollan
  utilizando un lenguaje de programacion.
- Es legible por el usuario (programador).
- Es ininteligible para el ordenador.
- Necesita de un proceso de traduccion: lenguaje -> hardware
*** Componentes
- Caracteres: Vocabulario o lexico -> simbolos permitidos.
- Sintaxis: Son las reglas que combinan los caracteres ->
  construcciones con los simbolos.
- Semantica: son las reglas que definen los efectos de cualquier
  construccion.
- Palabras reservadas.
*** Criterios para establecer las clasificaciones
**** Segun el nivel de abstraccion
***** Lenguaje de bajo nivel
- Son instrucciones complejas e ininteligibles -> secuencias
  de 0's y 1's.
- Es entendible por el ordenador (hardware).
- Es dependiente del hardware del ordenador (procesador,
  memoria, ...).
- No son portables entre distinto hardware (clonico, Apple,
  etc.).
- Trabaja con los registros de Memoria Fisica.
***** Lenguaje de Medio Nivel o Ensamblador
- Esta cercano al Hardware.
- Surge por la poce portabilidad del L. Maquina.
- Usa mnemotecnicos -> Mas legible por el usuario.
- Se trabaja con los registros del procesador y direcciones
  fisicas.
- No es facil de programar.
- El programador ademas de conocer el lenguaje ha de conocer
  el HW.
- Para hacerlo legible al ordenador:
  - Se compila.
  - Se traduce al lenguaje maquina.
***** Lenguaje de Alto Nivel
- Son la mayoria de los lenguajes actuales.
- Mas cercano al lenguaje humano, son mas intuitivos.
- Se ayudan de librerias y funciones.
- Para ejecutarse necesitan de un traductor (interprete o
  compilador).
- Son independientes de la maquina.
- Ejemplo: C++, Cobol, PHP, Java, ...
- Pueden ofrecer un framework (entorno de trabajo o
  desarrollo):
  - La programacion es mas eficiente y rapida.
  - Formado por un conjunto de elementos personalizables y
    adaptables a las necesidades de la aplicacion.
  - Ejemplo: bootstrap.
    - Utilizado en twitter.
    - Cualquiera puede realizar paginas y aplicaciones web.
**** Segun la forma de ejecucion
***** Compilados
- Necesitan de un traductor o compilador.
- Convierten de codigo fuente a codigo maquina.
- Mas rapidos que los interpretes o virtuales.
- Si se producen errores hay que modificar y volver a compilar.
- Utilizando un enlazador o linker:
  - Union (codigo objeto programa; codigo objeto de las
    librerias).
***** Interpretados
- Se carga en Memoria el interprete.
- Lee las instrucciones + las interpreta + las ejecuta.
- Es mas lento.
- No requiere volver a compilar ante un error.
- Ejemplo: Java -> combina compilacion e interpretacion
**** Paradigma de programacion
- Paradigma = enfoque particular para construir el SW -> reglas,
patrones, estilos de programacion, ...
- Un lenguaje de programacion puede usar mas de un paradigma ->
se usa el que interesa.
***** Categorias
****** Imperativos
- Instrucciones simples.
- Detallan como se manipula la informacion de la memoria.
- Sentencia principal -> la asignacion.
- Ejemplo: Basic, Java, Fortran, C++.
- Engloba: programacion estructurada, modular y la POO.
****** Funcionales
- Se basan en el concepto de funcion y los argumentos a
  aplicar.
- Ejemplo: Lisp, Schema, ML.
****** Logicos
- Los podemos ver como una BB.DD. de declaraciones logicas
  -> reglas.
- Ejecucion: consiste en preguntar (BB.DD.) de forma
  interactiva.
- Ej: Prolog -> sistemas expertos, prospecciones.
****** Estructurados
- Utilizan 3 construcciones logicas -> secuencial,
  condicional y repetitiva.
- De lectura y seguimiento facil.
- Si es grande su lectura y manejo se complica.
- Se puede dividir en partes manejables o modulos (con sus
  inputs y outputs).
  - Son independientes.
  - Hay uno raiz que controla al resto.
  - Permite un desarrollo mas rapido.
  - Es reutilizable.
  - Ej. Pascal, Fortran, C, Modula-2.
****** Orientados a objetos
- Un programa es visto como un conjunto de objetos.
- Objeto:
  - Es una estructura de datos + metodo u operaciones
    (comportamiento) que los manipulan.
  - Los datos son propiedades o atributos de los objetos.
  - Los metodos son propiedades o atributos.
  - La comunicacion se lleva a cabo mediante paso de mensajes.
- Clase:
  - Es una plantilla para crear objetos -> instaciacion.
  - Ejemplo: Java
  - Se asemeja a un modulo (programacion estructurada).   
- Permite reutilizar codigo, trabajar en equipo y
 mantenimiento del software. 
- Su programacion no es tan intuitiva.
- Ej.: C++, Java, Smaltalk.
*** Obtener codigo ejecutable
- Diseño:
  - Componente SW <-> nivel de detalle.
  - Herramientas: {Pseudocodigo | DFD}
  - Se codifica con un lenguaje de programacion.
- Codificacion: se genera el codigo fuente.
**** Tipos de codigo
***** Fuente
- Escrito por el programador.
- En lenguaje de alto nivel.
- Mediante editor de texto o herramienta de programacion.
- Se parte de lo pseudocodigos o DFD.
- No se ejecute por el ordenador.
