ENDE/Notas/index.html

<div id="outline-container-org7677221" class="outline-4">
<h4 id="org7677221">Programa</h4>
<div class="outline-text-4" id="text-org7677221">
<ul class="org-ul">
<li>Es una serie de ordenes o instrucciones.</li>
<li>Siguen un orden o secuencia para cumplir una finalidad determinado.</li>
<li>Ejemplo: Holamundo.c</li>
</ul>
</div>
</div>

<div id="outline-container-orgf8660a1" class="outline-4">
<h4 id="orgf8660a1">Aplicacion</h4>
<div class="outline-text-4" id="text-orgf8660a1">
<ul class="org-ul">
<li>Puede estar formada por uno o varios programas.</li>
<li>Esta en contacto con el usuario, no con el hardware.</li>
<li>Ejemplo: BB.DD., procesadores do texto, hojas de calculo, correo electronico.</li>
<li>Finalizar: automatizar o ayudar a realizar tareas.</li>
</ul>
</div>
</div>

<div id="outline-container-org497f8c2" class="outline-4">
<h4 id="org497f8c2">Suite o Paquete Integrado</h4>
<div class="outline-text-4" id="text-org497f8c2">
<ul class="org-ul">
<li>Es el conjunto de programas que se ejecutan unos
independientes del otro.</li>
<li>Ejemplo: Microsoft Office, Libre Office, Open Office.</li>
<li>Suelen compartir elementos comunes como librerias, datos. etc.</li>
<li>Son compatibles entre ellos.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgcc6d088" class="outline-3">
<h3 id="orgcc6d088">Lenguajes de programacion</h3>
<div class="outline-text-3" id="text-orgcc6d088">
<ul class="org-ul">
<li>Los programas son conjuntos de instrucciones que se desarrollan
utilizando un lenguaje de programacion.</li>
<li>Es legible por el usuario (programador).</li>
<li>Es ininteligible para el ordenador.</li>
<li>Necesita de un proceso de traduccion: lenguaje -&gt; hardware</li>
</ul>
</div>

<div id="outline-container-orgda6befb" class="outline-4">
<h4 id="orgda6befb">Componentes</h4>
<div class="outline-text-4" id="text-orgda6befb">
<ul class="org-ul">
<li>Caracteres: Vocabulario o lexico -&gt; simbolos permitidos.</li>
<li>Sintaxis: Son las reglas que combinan los caracteres -&gt;
construcciones con los simbolos.</li>
<li>Semantica: son las reglas que definen los efectos de cualquier
construccion.</li>
<li>Palabras reservadas.</li>
</ul>
</div>
</div>

<div id="outline-container-org2f20220" class="outline-4">
<h4 id="org2f20220">Criterios para establecer las clasificaciones</h4>
<div class="outline-text-4" id="text-org2f20220">
</div>
<div id="outline-container-orgcfdce1c" class="outline-5">
<h5 id="orgcfdce1c">Segun el nivel de abstraccion</h5>
<div class="outline-text-5" id="text-orgcfdce1c">
</div>
<div id="outline-container-orgc1f0326" class="outline-6">
<h6 id="orgc1f0326">Lenguaje de bajo nivel</h6>
<div class="outline-text-6" id="text-orgc1f0326">
<ul class="org-ul">
<li>Son instrucciones complejas e ininteligibles -&gt; secuencias
de 0's y 1's.</li>
<li>Es entendible por el ordenador (hardware).</li>
<li>Es dependiente del hardware del ordenador (procesador,
memoria, &#x2026;).</li>
<li>No son portables entre distinto hardware (clonico, Apple,
etc.).</li>
<li>Trabaja con los registros de Memoria Fisica.</li>
</ul>
</div>
</div>

<div id="outline-container-org7120aa8" class="outline-6">
<h6 id="org7120aa8">Lenguaje de Medio Nivel o Ensamblador</h6>
<div class="outline-text-6" id="text-org7120aa8">
<ul class="org-ul">
<li>Esta cercano al Hardware.</li>
<li>Surge por la poce portabilidad del L. Maquina.</li>
<li>Usa mnemotecnicos -&gt; Mas legible por el usuario.</li>
<li>Se trabaja con los registros del procesador y direcciones
fisicas.</li>
<li>No es facil de programar.</li>
<li>El programador ademas de conocer el lenguaje ha de conocer
el HW.</li>
<li>Para hacerlo legible al ordenador:
<ul class="org-ul">
<li>Se compila.</li>
<li>Se traduce al lenguaje maquina.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org010ba22" class="outline-6">
<h6 id="org010ba22">Lenguaje de Alto Nivel</h6>
<div class="outline-text-6" id="text-org010ba22">
<ul class="org-ul">
<li>Son la mayoria de los lenguajes actuales.</li>
<li>Mas cercano al lenguaje humano, son mas intuitivos.</li>
<li>Se ayudan de librerias y funciones.</li>
<li>Para ejecutarse necesitan de un traductor (interprete o
compilador).</li>
<li>Son independientes de la maquina.</li>
<li>Ejemplo: C++, Cobol, PHP, Java, &#x2026;</li>
<li>Pueden ofrecer un framework (entorno de trabajo o
desarrollo):
<ul class="org-ul">
<li>La programacion es mas eficiente y rapida.</li>
<li>Formado por un conjunto de elementos personalizables y
adaptables a las necesidades de la aplicacion.</li>
<li>Ejemplo: bootstrap.
<ul class="org-ul">
<li>Utilizado en twitter.</li>
<li>Cualquiera puede realizar paginas y aplicaciones web.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7c9e9ff" class="outline-5">
<h5 id="org7c9e9ff">Segun la forma de ejecucion</h5>
<div class="outline-text-5" id="text-org7c9e9ff">
</div>
<div id="outline-container-orgb523c73" class="outline-6">
<h6 id="orgb523c73">Compilados</h6>
<div class="outline-text-6" id="text-orgb523c73">
<ul class="org-ul">
<li>Necesitan de un traductor o compilador.</li>
<li>Convierten de codigo fuente a codigo maquina.</li>
<li>Mas rapidos que los interpretes o virtuales.</li>
<li>Si se producen errores hay que modificar y volver a compilar.</li>
<li>Utilizando un enlazador o linker:
<ul class="org-ul">
<li>Union (codigo objeto programa; codigo objeto de las
librerias).</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgae4e8ac" class="outline-6">
<h6 id="orgae4e8ac">Interpretados</h6>
<div class="outline-text-6" id="text-orgae4e8ac">
<ul class="org-ul">
<li>Se carga en Memoria el interprete.</li>
<li>Lee las instrucciones + las interpreta + las ejecuta.</li>
<li>Es mas lento.</li>
<li>No requiere volver a compilar ante un error.</li>
<li>Ejemplo: Java -&gt; combina compilacion e interpretacion</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org640ee79" class="outline-5">
<h5 id="org640ee79">Paradigma de programacion</h5>
<div class="outline-text-5" id="text-org640ee79">
<ul class="org-ul">
<li>Paradigma = enfoque particular para construir el SW -&gt; reglas,</li>
</ul>
<p>
patrones, estilos de programacion, &#x2026;
</p>
<ul class="org-ul">
<li>Un lenguaje de programacion puede usar mas de un paradigma -&gt;</li>
</ul>
<p>
se usa el que interesa.
</p>
</div>

<div id="outline-container-org6853eff" class="outline-6">
<h6 id="org6853eff">Categorias</h6>
<div class="outline-text-6" id="text-org6853eff">
</div>
<div id="outline-container-org7847076" class="outline-7">
<h7 id="org7847076">Imperativos</h7>
<div class="outline-text-7" id="text-org7847076">
<ul class="org-ul">
<li>Instrucciones simples.</li>
<li>Detallan como se manipula la informacion de la memoria.</li>
<li>Sentencia principal -&gt; la asignacion.</li>
<li>Ejemplo: Basic, Java, Fortran, C++.</li>
<li>Engloba: programacion estructurada, modular y la POO.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb38ecb7" class="outline-7">
<h7 id="orgb38ecb7">Funcionales</h7>
<div class="outline-text-7" id="text-orgb38ecb7">
<ul class="org-ul">
<li>Se basan en el concepto de funcion y los argumentos a
aplicar.</li>
<li>Ejemplo: Lisp, Schema, ML.</li>
</ul>
</div>
</div>

<div id="outline-container-orga2cd9f7" class="outline-7">
<h7 id="orga2cd9f7">Logicos</h7>
<div class="outline-text-7" id="text-orga2cd9f7">
<ul class="org-ul">
<li>Los podemos ver como una BB.DD. de declaraciones logicas
-&gt; reglas.</li>
<li>Ejecucion: consiste en preguntar (BB.DD.) de forma
interactiva.</li>
<li>Ej: Prolog -&gt; sistemas expertos, prospecciones.</li>
</ul>
</div>
</div>

<div id="outline-container-org7db926b" class="outline-7">
<h7 id="org7db926b">Estructurados</h7>
<div class="outline-text-7" id="text-org7db926b">
<ul class="org-ul">
<li>Utilizan 3 construcciones logicas -&gt; secuencial,
condicional y repetitiva.</li>
<li>De lectura y seguimiento facil.</li>
<li>Si es grande su lectura y manejo se complica.</li>
<li>Se puede dividir en partes manejables o modulos (con sus
inputs y outputs).
<ul class="org-ul">
<li>Son independientes.</li>
<li>Hay uno raiz que controla al resto.</li>
<li>Permite un desarrollo mas rapido.</li>
<li>Es reutilizable.</li>
<li>Ej. Pascal, Fortran, C, Modula-2.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgb0643d9" class="outline-7">
<h7 id="orgb0643d9">Orientados a objetos</h7>
<div class="outline-text-7" id="text-orgb0643d9">
<ul class="org-ul">
<li>Un programa es visto como un conjunto de objetos.</li>
<li>Objeto:
<ul class="org-ul">
<li>Es una estructura de datos + metodo u operaciones
(comportamiento) que los manipulan.</li>
<li>Los datos son propiedades o atributos de los objetos.</li>
<li>Los metodos son propiedades o atributos.</li>
<li>La comunicacion se lleva a cabo mediante paso de mensajes.</li>
</ul></li>
<li>Clase:
<ul class="org-ul">
<li>Es una plantilla para crear objetos -&gt; instaciacion.</li>
<li>Ejemplo: Java</li>
<li>Se asemeja a un modulo (programacion estructurada).</li>
</ul></li>
<li>Permite reutilizar codigo, trabajar en equipo y
mantenimiento del software.</li>
<li>Su programacion no es tan intuitiva.</li>
<li>Ej.: C++, Java, Smaltalk.</li>
</ul>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgad712ff" class="outline-4">
<h4 id="orgad712ff">Obtener codigo ejecutable</h4>
<div class="outline-text-4" id="text-orgad712ff">
<ul class="org-ul">
<li>Diseño:
<ul class="org-ul">
<li>Componente SW &lt;-&gt; nivel de detalle.</li>
<li>Herramientas: {Pseudocodigo | DFD}</li>
<li>Se codifica con un lenguaje de programacion.</li>
</ul></li>
<li>Codificacion: se genera el codigo fuente.</li>
</ul>
</div>

<div id="outline-container-orgcaa821d" class="outline-5">
<h5 id="orgcaa821d">Tipos de codigo</h5>
<div class="outline-text-5" id="text-orgcaa821d">
</div>
<div id="outline-container-orge4a8630" class="outline-6">
<h6 id="orge4a8630">Fuente</h6>
<div class="outline-text-6" id="text-orge4a8630">
<ul class="org-ul">
<li>Escrito por el programador.</li>
<li>En lenguaje de alto nivel.</li>
<li>Mediante editor de texto o herramienta de programacion.</li>
<li>Se parte de lo pseudocodigos o DFD.</li>
<li>No se ejecute por el ordenador.</li>
</ul>
</div>
</div>
