docs.org/ENDE/Notas/index.org
***** Objeto
- Resultado de compilar el codigo fuente.
- No se ejecuta en el ordenador.
- Ininteligible por el humano.
- Representacion a bajo nivel.
***** Ejecutable
- Resultado de enlazar: codigo objeto + rutinas + librerias.
**** Compilacion
***** Compilador
- Si existe un error en la compilacion -> no se genera el
  codigo objeto -> modificar el codigo fuente + compilar.
- Etapas:
  - Analisis lexico.
  - Analisis sintactico.
  - Analisis semantico.
  - Genera codigo intermedio.
  - Optimizar codigo.
  - Generar codigo.
***** Enlazador
- Inserta en el codigo objeto las funciones de las librerias.
** Maquinas Virtuales
- El codigo es un codigo intermedio -> bytecode.
- Son mas portables -> sirven para distintas plataformas (Windows,
  Linux, Apple, ...).
- El codigo es interpretado por una maquina virtual.
- Su ejecucion es lenta.
- Son muy versatiles.
- Aplicacion SW de un equipo que ejecuta programas como si fuese una
  maquina real.
*** Categorias
**** De sistema
- Ejecuta en la misma fisica distintas maquinas virtuales con
  distintos sistemas operativos.
- Ej: VMWare, VBox
**** De proceso o de aplicacion
- La VM se ejecuta como un proceso en el SS.OO.
- Objetivo: proporcionar un entorno de ejecucion con
  independiencia del HW y el OS.
- Permite que un programa se ejecute de distinta manera en
  distinta plataforma.
- Ejemplo: VM Java
*** La maquina virtual de Java
- Programa compilador Java -> se ejecuta en distintos entornos.
- El codigo generado por el compilador -> lo ejecuta la JVM, no el
  procesador.
- Dibujo.
**** Tareas o funciones
- Reservar / Liberar memoria para los objetos.
- Comunicarse con el HW.
- Comprobar el cumplimiento de las normas de seguridad de
  aplicaciones Java.
- Inconvenientes:
  - Ejecucion mas lenta.
- Descargar e instalar el JRE.
** Lenguajes mas difundidos. Caracteristicas.
*** Java
- Evolucion de C++ -> lo simplifica.
- LOO (Lenguaje Orientado a Objetos).
- Capaz de trabajar con redes y protocolos (IP, HTTP, FTP, ...).
- Lenguaje Virtual Interpretado.
- Portable.
- Contempla aspectos de seguridad.
- Permite ejecucion multihilo.
*** Python
- De alto nivel pero simple y sencillo
- Muy portable.
- Interpretado como Java: codigo fuente -> bytecode.
- El enlace con las librerias -> Al ejecutar el bytecode.
- LOO.
- Incrustable en otros lenguajes como C y C++.
*** C y C++
- Potente, versatil y se sigue utilizando.
- Ligado a Unix.
- Estructurado y ligado al uso de funciones.
- Puede incluir codigo que trabaje a bajo nivel.
- Programas eficientes y rapidos.
- Tamaño pequeño de los programas.
- Portable, aunque puede necesitar modificaciones.
*** JavaScript
- En programacion web.
- Parecido a Java, C, C++.
- Se ejecuta en el cliente.
- Es seguro y fiable.
- Tiene limitaciones de seguridad.
- Codigo visible -> podemos leerlo.
- Existen muchas librerias basadas en JavaScript como JQuery.
*** PHP
- Multiplataforma.
- Para desarrollar webs dinamicas.
- Buena integracion con MySQL.
- Puede usar tecnicas de POO (Programacion Orientada a Objetos).
- Interpretado en la parte del servidor.
- En backend de CMS (Pretashop, Wordpress, ...).
*** VB.NET
- Evolucion de Visual Basic.
- LOO.
- Herramientas para programarlo.
  - Microsoft Visual Estudio.
  - Sharp Develop -> Libre, menos potente.
** Desarrollo de una aplicacion
- Existen distintos paradigmas.
*** Fases
**** Inicial
- Planificacion, Estimaciones y Rentabilidad del proyecto.
- Simil: construccion de un edificio: licencia, coste,
  trabajadores, tiempo, ...
- Gente experimentada en:
  - Elaboracion del proyecto.
  - Plataforma de construccion.
**** Analisis
- Se recopilan, examinan y formulan los requisitos del cliente.
- Se analizan posibles restricciones.
- Se documentan y registran las entrevistas con el cliente.
- El cliente se compromete a no variar nada hasta la 1a release.
- El exito del proyecto esta en funcion de comprender y entender
  lo que quiere el cliente para darle una solucion lo mas
  acertada posible.
- No es facil, ya que los requisitos no quedan claros, surgen
  nuevos, etc.
- Importante: comunicacion cliente-desarrollador.
***** Tecnicas utilizadas
- Entrevistas.
- Desarrollo conjunto de aplicaciones, donde cada persona
  juega un rol.
- Planificacion conjunta de requisitos.
- Brainstorming.
- Prototipos.
- Casos de Uso: UML (Lenguaje Unificado de Marcas) ->
  escenarios, comportamientos -> requisitos funcionales.
***** Tipos de requisitos
- Funcionales: Comportamiento del sistema ante determinados
  inputs.
- No Funcionales: sobre caracteristicas del sistema:
  fiabilidad, plataforma, HW, ...
  | Funcionales                            | No Funcionales                      |
  |----------------------------------------+-------------------------------------|
  | El usuario puede agregar               | La aplicacion debe funcionar en     |
  | un nuevo contacto                      | SS.OO. Linux y Windows              |
  |----------------------------------------+-------------------------------------|
  | El usuario puede ver una               | El tiempo de respuesta a consultas, |
  | lista con todos los contactos          | altas, bajas y modificaciones ha de |
  |                                        | ser inferior a 5 segundos           |
  |----------------------------------------+-------------------------------------|
  | A partir de la lista de contactos      | Utilizar un sistema gestor de bases |
  | el usuario puede acceder a un contacto | de datos                            |
