ENDE/Notas/index.html

<div id="outline-container-orge10f77f" class="outline-6">
<h6 id="orge10f77f">Objeto</h6>
<div class="outline-text-6" id="text-orge10f77f">
<ul class="org-ul">
<li>Resultado de compilar el codigo fuente.</li>
<li>No se ejecuta en el ordenador.</li>
<li>Ininteligible por el humano.</li>
<li>Representacion a bajo nivel.</li>
</ul>
</div>
</div>

<div id="outline-container-org2ff822f" class="outline-6">
<h6 id="org2ff822f">Ejecutable</h6>
<div class="outline-text-6" id="text-org2ff822f">
<ul class="org-ul">
<li>Resultado de enlazar: codigo objeto + rutinas + librerias.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3078ba6" class="outline-5">
<h5 id="org3078ba6">Compilacion</h5>
<div class="outline-text-5" id="text-org3078ba6">
</div>
<div id="outline-container-orgac02f79" class="outline-6">
<h6 id="orgac02f79">Compilador</h6>
<div class="outline-text-6" id="text-orgac02f79">
<ul class="org-ul">
<li>Si existe un error en la compilacion -&gt; no se genera el
codigo objeto -&gt; modificar el codigo fuente + compilar.</li>
<li>Etapas:
<ul class="org-ul">
<li>Analisis lexico.</li>
<li>Analisis sintactico.</li>
<li>Analisis semantico.</li>
<li>Genera codigo intermedio.</li>
<li>Optimizar codigo.</li>
<li>Generar codigo.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org532f473" class="outline-6">
<h6 id="org532f473">Enlazador</h6>
<div class="outline-text-6" id="text-org532f473">
<ul class="org-ul">
<li>Inserta en el codigo objeto las funciones de las librerias.</li>
</ul>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org2744220" class="outline-3">
<h3 id="org2744220">Maquinas Virtuales</h3>
<div class="outline-text-3" id="text-org2744220">
<ul class="org-ul">
<li>El codigo es un codigo intermedio -&gt; bytecode.</li>
<li>Son mas portables -&gt; sirven para distintas plataformas (Windows,
Linux, Apple, &#x2026;).</li>
<li>El codigo es interpretado por una maquina virtual.</li>
<li>Su ejecucion es lenta.</li>
<li>Son muy versatiles.</li>
<li>Aplicacion SW de un equipo que ejecuta programas como si fuese una
maquina real.</li>
</ul>
</div>

<div id="outline-container-org5253eee" class="outline-4">
<h4 id="org5253eee">Categorias</h4>
<div class="outline-text-4" id="text-org5253eee">
</div>
<div id="outline-container-org776b854" class="outline-5">
<h5 id="org776b854">De sistema</h5>
<div class="outline-text-5" id="text-org776b854">
<ul class="org-ul">
<li>Ejecuta en la misma fisica distintas maquinas virtuales con
distintos sistemas operativos.</li>
<li>Ej: VMWare, VBox</li>
</ul>
</div>
</div>

<div id="outline-container-org52954ed" class="outline-5">
<h5 id="org52954ed">De proceso o de aplicacion</h5>
<div class="outline-text-5" id="text-org52954ed">
<ul class="org-ul">
<li>La VM se ejecuta como un proceso en el SS.OO.</li>
<li>Objetivo: proporcionar un entorno de ejecucion con
independiencia del HW y el OS.</li>
<li>Permite que un programa se ejecute de distinta manera en
distinta plataforma.</li>
<li>Ejemplo: VM Java</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org5e1019d" class="outline-4">
<h4 id="org5e1019d">La maquina virtual de Java</h4>
<div class="outline-text-4" id="text-org5e1019d">
<ul class="org-ul">
<li>Programa compilador Java -&gt; se ejecuta en distintos entornos.</li>
<li>El codigo generado por el compilador -&gt; lo ejecuta la JVM, no el
procesador.</li>
<li>Dibujo.</li>
</ul>
</div>

<div id="outline-container-org9466b0a" class="outline-5">
<h5 id="org9466b0a">Tareas o funciones</h5>
<div class="outline-text-5" id="text-org9466b0a">
<ul class="org-ul">
<li>Reservar / Liberar memoria para los objetos.</li>
<li>Comunicarse con el HW.</li>
<li>Comprobar el cumplimiento de las normas de seguridad de
aplicaciones Java.</li>
<li>Inconvenientes:
<ul class="org-ul">
<li>Ejecucion mas lenta.</li>
</ul></li>
<li>Descargar e instalar el JRE.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org16b346c" class="outline-3">
<h3 id="org16b346c">Lenguajes mas difundidos. Caracteristicas.</h3>
<div class="outline-text-3" id="text-org16b346c">
</div>
<div id="outline-container-orgeabd3b0" class="outline-4">
<h4 id="orgeabd3b0">Java</h4>
<div class="outline-text-4" id="text-orgeabd3b0">
<ul class="org-ul">
<li>Evolucion de C++ -&gt; lo simplifica.</li>
<li>LOO (Lenguaje Orientado a Objetos).</li>
<li>Capaz de trabajar con redes y protocolos (IP, HTTP, FTP, &#x2026;).</li>
<li>Lenguaje Virtual Interpretado.</li>
<li>Portable.</li>
<li>Contempla aspectos de seguridad.</li>
<li>Permite ejecucion multihilo.</li>
</ul>
</div>
</div>

<div id="outline-container-org63abca3" class="outline-4">
<h4 id="org63abca3">Python</h4>
<div class="outline-text-4" id="text-org63abca3">
<ul class="org-ul">
<li>De alto nivel pero simple y sencillo</li>
<li>Muy portable.</li>
<li>Interpretado como Java: codigo fuente -&gt; bytecode.</li>
<li>El enlace con las librerias -&gt; Al ejecutar el bytecode.</li>
<li>LOO.</li>
<li>Incrustable en otros lenguajes como C y C++.</li>
</ul>
</div>
</div>

<div id="outline-container-orga1fec64" class="outline-4">
<h4 id="orga1fec64">C y C++</h4>
<div class="outline-text-4" id="text-orga1fec64">
<ul class="org-ul">
<li>Potente, versatil y se sigue utilizando.</li>
<li>Ligado a Unix.</li>
<li>Estructurado y ligado al uso de funciones.</li>
<li>Puede incluir codigo que trabaje a bajo nivel.</li>
<li>Programas eficientes y rapidos.</li>
<li>Tamaño pequeño de los programas.</li>
<li>Portable, aunque puede necesitar modificaciones.</li>
</ul>
</div>
</div>

<div id="outline-container-org93e4c7b" class="outline-4">
<h4 id="org93e4c7b">JavaScript</h4>
<div class="outline-text-4" id="text-org93e4c7b">
<ul class="org-ul">
<li>En programacion web.</li>
<li>Parecido a Java, C, C++.</li>
<li>Se ejecuta en el cliente.</li>
<li>Es seguro y fiable.</li>
<li>Tiene limitaciones de seguridad.</li>
<li>Codigo visible -&gt; podemos leerlo.</li>
<li>Existen muchas librerias basadas en JavaScript como JQuery.</li>
</ul>
</div>
</div>

<div id="outline-container-org7f5cee4" class="outline-4">
<h4 id="org7f5cee4">PHP</h4>
<div class="outline-text-4" id="text-org7f5cee4">
<ul class="org-ul">
<li>Multiplataforma.</li>
<li>Para desarrollar webs dinamicas.</li>
<li>Buena integracion con MySQL.</li>
<li>Puede usar tecnicas de POO (Programacion Orientada a Objetos).</li>
<li>Interpretado en la parte del servidor.</li>
<li>En backend de CMS (Pretashop, Wordpress, &#x2026;).</li>
</ul>
</div>
</div>

<div id="outline-container-orgee8143a" class="outline-4">
<h4 id="orgee8143a">VB.NET</h4>
<div class="outline-text-4" id="text-orgee8143a">
<ul class="org-ul">
<li>Evolucion de Visual Basic.</li>
<li>LOO.</li>
<li>Herramientas para programarlo.
<ul class="org-ul">
<li>Microsoft Visual Estudio.</li>
<li>Sharp Develop -&gt; Libre, menos potente.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org30eeaa9" class="outline-3">
<h3 id="org30eeaa9">Desarrollo de una aplicacion</h3>
<div class="outline-text-3" id="text-org30eeaa9">
<ul class="org-ul">
<li>Existen distintos paradigmas.</li>
</ul>
</div>

<div id="outline-container-org1894de7" class="outline-4">
<h4 id="org1894de7">Fases</h4>
<div class="outline-text-4" id="text-org1894de7">
</div>
<div id="outline-container-org1639f4f" class="outline-5">
<h5 id="org1639f4f">Inicial</h5>
<div class="outline-text-5" id="text-org1639f4f">
<ul class="org-ul">
<li>Planificacion, Estimaciones y Rentabilidad del proyecto.</li>
<li>Simil: construccion de un edificio: licencia, coste,
trabajadores, tiempo, &#x2026;</li>
<li>Gente experimentada en:
<ul class="org-ul">
<li>Elaboracion del proyecto.</li>
<li>Plataforma de construccion.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org30e3618" class="outline-5">
<h5 id="org30e3618">Analisis</h5>
<div class="outline-text-5" id="text-org30e3618">
<ul class="org-ul">
<li>Se recopilan, examinan y formulan los requisitos del cliente.</li>
<li>Se analizan posibles restricciones.</li>
<li>Se documentan y registran las entrevistas con el cliente.</li>
<li>El cliente se compromete a no variar nada hasta la 1a release.</li>
<li>El exito del proyecto esta en funcion de comprender y entender
lo que quiere el cliente para darle una solucion lo mas
acertada posible.</li>
<li>No es facil, ya que los requisitos no quedan claros, surgen
nuevos, etc.</li>
<li>Importante: comunicacion cliente-desarrollador.</li>
</ul>
</div>

<div id="outline-container-org0822c73" class="outline-6">
<h6 id="org0822c73">Tecnicas utilizadas</h6>
<div class="outline-text-6" id="text-org0822c73">
<ul class="org-ul">
<li>Entrevistas.</li>
<li>Desarrollo conjunto de aplicaciones, donde cada persona
juega un rol.</li>
<li>Planificacion conjunta de requisitos.</li>
<li>Brainstorming.</li>
<li>Prototipos.</li>
<li>Casos de Uso: UML (Lenguaje Unificado de Marcas) -&gt;
escenarios, comportamientos -&gt; requisitos funcionales.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb095e3" class="outline-6">
<h6 id="orgdb095e3">Tipos de requisitos</h6>
<div class="outline-text-6" id="text-orgdb095e3">
<ul class="org-ul">
<li>Funcionales: Comportamiento del sistema ante determinados
inputs.</li>
<li><p>
No Funcionales: sobre caracteristicas del sistema:
fiabilidad, plataforma, HW, &#x2026;
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Funcionales</th>
<th scope="col" class="org-left">No Funcionales</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">El usuario puede agregar</td>
<td class="org-left">La aplicacion debe funcionar en</td>
</tr>

<tr>
<td class="org-left">un nuevo contacto</td>
<td class="org-left">SS.OO. Linux y Windows</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">El usuario puede ver una</td>
<td class="org-left">El tiempo de respuesta a consultas,</td>
</tr>

<tr>
<td class="org-left">lista con todos los contactos</td>
<td class="org-left">altas, bajas y modificaciones ha de</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">ser inferior a 5 segundos</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">A partir de la lista de contactos</td>
<td class="org-left">Utilizar un sistema gestor de bases</td>
</tr>

<tr>
<td class="org-left">el usuario puede acceder a un contacto</td>
<td class="org-left">de datos</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>
