docs.org/ENDE/Notas/index.org
***** Representacion de requisitos
****** DFD (Diagrama De Flujo de Datos)
- Procesos -> Funciones
- Entidades externas: no pertenecen al sistema y proporciona
  datos o se reciben de el.
- Almacenes: almacena los datos procesados.
- Flujo de datos.
****** DFC (Diagrama de Flujo de Control)
- Muestra el flujo de control, no de Estados.
****** DTE (Diagrama de Transicion de Estados)
- Comportamiento del sistema en funcion de los sucesos externos.
****** DER (Diagrama Entidad Relacion)
- Representa los datos y como se relacionan entre ellos.
- Entidades.
- Relaciones.
****** DD (Diccionario de Datos)
- Describe detalladamente los datos (flujo, almacenes) del
  DFD.
****** Documento Generado
- Especificacion de Requisiton del SW.
- Estructura: IEEE 830.
**** Diseño
- Composicion sobre la solucion al problema.
- Requisitos -> representacion del SW.
- Se realizan 2 documentos por los analistas, supervisado por el
  jefe del proyecto.
  - Se determinan los requisitos generales de la arquitectura de
    la aplicacion.
  - Se define con precision cada subconjunto de la aplcacion.
***** Estructurado: flujo de datos sobre el sistema.
****** Diseño de datos
- Son las estructuras de datos necesarias para implementar
  el software.
- Se basan en el diagrama E/R y la descripcion detallada
  de los datos.
****** Diseño arquitectonico
- Se centra en la representacion de la estructura de los
  componentes del SW, sus propiedades e interacciones.
- Un componente del SW puede ser desde un modulo de
  programa, una BB.DD., conectores que permitan la
  comunicacion, etc.
- Se parte del DFD para establecer la estructura modular
  del SW a desarrollar.
****** Diseño de la interfaz
- Describe la comunicacion entre (SW, Personas, Otros
  sistemas).
- El resultado -> Creacion de formatos de pantalla.
****** Diseño a nivel de componentes
- Transforma: elementos estructurales (arquitectura) en
  una descripcion procedimental -> diseño de componentes
  SW.
- El nivel de detalle de cada componente del software se
  debe poder codificar mediante un lenguaje de
  programacion.
- Sus fundamentos se basan en distintas representaciones
  graficas utilizando notaciones como:
  - Diagramas de flujo.
  - Diagramas de cajas.
  - Tablas de decision.
  - Pseudocodigo.
- Construcciones logicas para formar un programa ->
  programacion estructurada:
  - Secuencial
  - Condicional
  - Seleccion Multiple
  - Repetitiva
***** O.O.: objetos, propiedades, comportamiento, eventos, estado.
- Es dificil.
- Parte de un Analisis O.O.
- Etapas:
  - Subsistemas que implementan las pricipales funciones del
    sistema.
  - Clases y Objetos:
    - Arquitectura de objetos global.
    - Jerarquia de clases.
  - Mensajes: colaboracion entre Objetos.
- UML:
  - Diagramas para expresar modelos.
  - Estandar de facto.
**** Codificacion o Implementacion
- Implementa el software mediante un lenguaje de programacion.
- Documentacion detallada que contiene el codigo (E/, S/,
  revision, ...)
- Mucho codigo se suele comentar en el mismo programa.
- Importancia:
  - Puede mantenerse por la misma u otra persona.
  - La que lo mantenga ha de saber que hace cada parte y como lo
    hace.
**** Pruebas
- Garantizan que cumple las especificaciones del cliente.
- Los mismos programas se integran bien y esta listo para la
  explotacion.
- Documentos y pruebas (Con el cliente presente, opcional):
  - Se ve si cumple con las funciones acordadas en los
    documentos.
  - Se detallan:
    - Los fallos.
    - Las modificaciones.
- Estructurales:
  - Pruebas tecnicas (sin clientes).
  - Cargas reales, estres del sistema y de la aplicacion.
**** Explotacion
- Instalacion del software en el entorno real.
- Se trabaja con el de forma normal.
- Fase mas larga: incidencias, nuevas necesidades, etc.
- Documentacion:
  - Errores o fallos concretos.
  - Los analistas y programadores los revisan y solucionan.
  - Otras necesidades -> en Mantenimiento
**** Mantenimiento
- Acciones:
  - Correctivas de fallos.
  - Actualizaciones -> adaptarlos y evolucionarias.
- Se utiliza la documentacion tecnica.
- Todo se documenta: que operacion, que hace, como -> pruebas
  distintas para el programador.
- TODAS LAS FASES SE VAN SOLAPANDO. CUANDO FINALIZAN, SU
  RESULTADO ES LA APLICACION
**** Documentacion
- Debe ser util y adaptada a los usuarios de dicha
  documentacion. Como minimo:
  - Manual de usuario:
    - Para utilizar el programa, manejo, lo que hay que hacer,
      lo que no.
    - Ayuda, explicativo.
  - Manual tecnico:
    - Tecnicos que conozcan el lenguaje.
    - Para que la conozcan como los que la crearon.
  - Manual de instalacion:
    - Requisitos necesarios.
    - Como se instala.
    - Como so pne en funcionamiento.
*** Roles en el desarrollo de software
**** Arquitecto del SW
- Decide:
  - Como va a realizarse.
  - Como se va a cohesionar.
- Con elevado conocimiento de tecnologias, frameworks,
  librerias, etc.
- Decide la forma y recursos del proyecto.
**** Jefe de Proyecto
- Dirige el proyecto.
- Puede ser un analista experimentado.
- Sabiduria en gestinar:
  - Equipos.
  - Tiempos.
  - Relacion con clientes.
  - Etc
**** Analista del sistema
- Tiene mucha experiencia.
* TEMA 2
- ...
