ENDE/Notas/index.html

<div id="outline-container-orgbeaeb55" class="outline-6">
<h6 id="orgbeaeb55">Representacion de requisitos</h6>
<div class="outline-text-6" id="text-orgbeaeb55">
</div>
<div id="outline-container-org774cf6e" class="outline-7">
<h7 id="org774cf6e">DFD (Diagrama De Flujo de Datos)</h7>
<div class="outline-text-7" id="text-org774cf6e">
<ul class="org-ul">
<li>Procesos -&gt; Funciones</li>
<li>Entidades externas: no pertenecen al sistema y proporciona
datos o se reciben de el.</li>
<li>Almacenes: almacena los datos procesados.</li>
<li>Flujo de datos.</li>
</ul>
</div>
</div>

<div id="outline-container-org8ee0920" class="outline-7">
<h7 id="org8ee0920">DFC (Diagrama de Flujo de Control)</h7>
<div class="outline-text-7" id="text-org8ee0920">
<ul class="org-ul">
<li>Muestra el flujo de control, no de Estados.</li>
</ul>
</div>
</div>

<div id="outline-container-org1b42f9b" class="outline-7">
<h7 id="org1b42f9b">DTE (Diagrama de Transicion de Estados)</h7>
<div class="outline-text-7" id="text-org1b42f9b">
<ul class="org-ul">
<li>Comportamiento del sistema en funcion de los sucesos externos.</li>
</ul>
</div>
</div>

<div id="outline-container-orgce9a028" class="outline-7">
<h7 id="orgce9a028">DER (Diagrama Entidad Relacion)</h7>
<div class="outline-text-7" id="text-orgce9a028">
<ul class="org-ul">
<li>Representa los datos y como se relacionan entre ellos.</li>
<li>Entidades.</li>
<li>Relaciones.</li>
</ul>
</div>
</div>

<div id="outline-container-org8c9c50c" class="outline-7">
<h7 id="org8c9c50c">DD (Diccionario de Datos)</h7>
<div class="outline-text-7" id="text-org8c9c50c">
<ul class="org-ul">
<li>Describe detalladamente los datos (flujo, almacenes) del
DFD.</li>
</ul>
</div>
</div>

<div id="outline-container-orga586ab3" class="outline-7">
<h7 id="orga586ab3">Documento Generado</h7>
<div class="outline-text-7" id="text-orga586ab3">
<ul class="org-ul">
<li>Especificacion de Requisiton del SW.</li>
<li>Estructura: IEEE 830.</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org2e2ac60" class="outline-5">
<h5 id="org2e2ac60">Diseño</h5>
<div class="outline-text-5" id="text-org2e2ac60">
<ul class="org-ul">
<li>Composicion sobre la solucion al problema.</li>
<li>Requisitos -&gt; representacion del SW.</li>
<li>Se realizan 2 documentos por los analistas, supervisado por el
jefe del proyecto.
<ul class="org-ul">
<li>Se determinan los requisitos generales de la arquitectura de
la aplicacion.</li>
<li>Se define con precision cada subconjunto de la aplcacion.</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org3230df8" class="outline-6">
<h6 id="org3230df8">Estructurado: flujo de datos sobre el sistema.</h6>
<div class="outline-text-6" id="text-org3230df8">
</div>
<div id="outline-container-orgb96f17b" class="outline-7">
<h7 id="orgb96f17b">Diseño de datos</h7>
<div class="outline-text-7" id="text-orgb96f17b">
<ul class="org-ul">
<li>Son las estructuras de datos necesarias para implementar
el software.</li>
<li>Se basan en el diagrama E/R y la descripcion detallada
de los datos.</li>
</ul>
</div>
</div>

<div id="outline-container-org6784301" class="outline-7">
<h7 id="org6784301">Diseño arquitectonico</h7>
<div class="outline-text-7" id="text-org6784301">
<ul class="org-ul">
<li>Se centra en la representacion de la estructura de los
componentes del SW, sus propiedades e interacciones.</li>
<li>Un componente del SW puede ser desde un modulo de
programa, una BB.DD., conectores que permitan la
comunicacion, etc.</li>
<li>Se parte del DFD para establecer la estructura modular
del SW a desarrollar.</li>
</ul>
</div>
</div>

<div id="outline-container-org651ab6f" class="outline-7">
<h7 id="org651ab6f">Diseño de la interfaz</h7>
<div class="outline-text-7" id="text-org651ab6f">
<ul class="org-ul">
<li>Describe la comunicacion entre (SW, Personas, Otros
sistemas).</li>
<li>El resultado -&gt; Creacion de formatos de pantalla.</li>
</ul>
</div>
</div>

<div id="outline-container-org12f8322" class="outline-7">
<h7 id="org12f8322">Diseño a nivel de componentes</h7>
<div class="outline-text-7" id="text-org12f8322">
<ul class="org-ul">
<li>Transforma: elementos estructurales (arquitectura) en
una descripcion procedimental -&gt; diseño de componentes
SW.</li>
<li>El nivel de detalle de cada componente del software se
debe poder codificar mediante un lenguaje de
programacion.</li>
<li>Sus fundamentos se basan en distintas representaciones
graficas utilizando notaciones como:
<ul class="org-ul">
<li>Diagramas de flujo.</li>
<li>Diagramas de cajas.</li>
<li>Tablas de decision.</li>
<li>Pseudocodigo.</li>
</ul></li>
<li>Construcciones logicas para formar un programa -&gt;
programacion estructurada:
<ul class="org-ul">
<li>Secuencial</li>
<li>Condicional</li>
<li>Seleccion Multiple</li>
<li>Repetitiva</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbc40627" class="outline-6">
<h6 id="orgbc40627">O.O.: objetos, propiedades, comportamiento, eventos, estado.</h6>
<div class="outline-text-6" id="text-orgbc40627">
<ul class="org-ul">
<li>Es dificil.</li>
<li>Parte de un Analisis O.O.</li>
<li>Etapas:
<ul class="org-ul">
<li>Subsistemas que implementan las pricipales funciones del
sistema.</li>
<li>Clases y Objetos:
<ul class="org-ul">
<li>Arquitectura de objetos global.</li>
<li>Jerarquia de clases.</li>
</ul></li>
<li>Mensajes: colaboracion entre Objetos.</li>
</ul></li>
<li>UML:
<ul class="org-ul">
<li>Diagramas para expresar modelos.</li>
<li>Estandar de facto.</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orga33cf29" class="outline-5">
<h5 id="orga33cf29">Codificacion o Implementacion</h5>
<div class="outline-text-5" id="text-orga33cf29">
<ul class="org-ul">
<li>Implementa el software mediante un lenguaje de programacion.</li>
<li>Documentacion detallada que contiene el codigo (E/, S/,
revision, &#x2026;)</li>
<li>Mucho codigo se suele comentar en el mismo programa.</li>
<li>Importancia:
<ul class="org-ul">
<li>Puede mantenerse por la misma u otra persona.</li>
<li>La que lo mantenga ha de saber que hace cada parte y como lo
hace.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org15c69f1" class="outline-5">
<h5 id="org15c69f1">Pruebas</h5>
<div class="outline-text-5" id="text-org15c69f1">
<ul class="org-ul">
<li>Garantizan que cumple las especificaciones del cliente.</li>
<li>Los mismos programas se integran bien y esta listo para la
explotacion.</li>
<li>Documentos y pruebas (Con el cliente presente, opcional):
<ul class="org-ul">
<li>Se ve si cumple con las funciones acordadas en los
documentos.</li>
<li>Se detallan:
<ul class="org-ul">
<li>Los fallos.</li>
<li>Las modificaciones.</li>
</ul></li>
</ul></li>
<li>Estructurales:
<ul class="org-ul">
<li>Pruebas tecnicas (sin clientes).</li>
<li>Cargas reales, estres del sistema y de la aplicacion.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orga4ace00" class="outline-5">
<h5 id="orga4ace00">Explotacion</h5>
<div class="outline-text-5" id="text-orga4ace00">
<ul class="org-ul">
<li>Instalacion del software en el entorno real.</li>
<li>Se trabaja con el de forma normal.</li>
<li>Fase mas larga: incidencias, nuevas necesidades, etc.</li>
<li>Documentacion:
<ul class="org-ul">
<li>Errores o fallos concretos.</li>
<li>Los analistas y programadores los revisan y solucionan.</li>
<li>Otras necesidades -&gt; en Mantenimiento</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4c93043" class="outline-5">
<h5 id="org4c93043">Mantenimiento</h5>
<div class="outline-text-5" id="text-org4c93043">
<ul class="org-ul">
<li>Acciones:
<ul class="org-ul">
<li>Correctivas de fallos.</li>
<li>Actualizaciones -&gt; adaptarlos y evolucionarias.</li>
</ul></li>
<li>Se utiliza la documentacion tecnica.</li>
<li>Todo se documenta: que operacion, que hace, como -&gt; pruebas
distintas para el programador.</li>
<li>TODAS LAS FASES SE VAN SOLAPANDO. CUANDO FINALIZAN, SU
RESULTADO ES LA APLICACION</li>
</ul>
</div>
</div>

<div id="outline-container-org74edc7c" class="outline-5">
<h5 id="org74edc7c">Documentacion</h5>
<div class="outline-text-5" id="text-org74edc7c">
<ul class="org-ul">
<li>Debe ser util y adaptada a los usuarios de dicha
documentacion. Como minimo:
<ul class="org-ul">
<li>Manual de usuario:
<ul class="org-ul">
<li>Para utilizar el programa, manejo, lo que hay que hacer,
lo que no.</li>
<li>Ayuda, explicativo.</li>
</ul></li>
<li>Manual tecnico:
<ul class="org-ul">
<li>Tecnicos que conozcan el lenguaje.</li>
<li>Para que la conozcan como los que la crearon.</li>
</ul></li>
<li>Manual de instalacion:
<ul class="org-ul">
<li>Requisitos necesarios.</li>
<li>Como se instala.</li>
<li>Como so pne en funcionamiento.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3f43410" class="outline-4">
<h4 id="org3f43410">Roles en el desarrollo de software</h4>
<div class="outline-text-4" id="text-org3f43410">
</div>
<div id="outline-container-orgbbc9dd2" class="outline-5">
<h5 id="orgbbc9dd2">Arquitecto del SW</h5>
<div class="outline-text-5" id="text-orgbbc9dd2">
<ul class="org-ul">
<li>Decide:
<ul class="org-ul">
<li>Como va a realizarse.</li>
<li>Como se va a cohesionar.</li>
</ul></li>
<li>Con elevado conocimiento de tecnologias, frameworks,
librerias, etc.</li>
<li>Decide la forma y recursos del proyecto.</li>
</ul>
</div>
</div>

<div id="outline-container-orge699ef1" class="outline-5">
<h5 id="orge699ef1">Jefe de Proyecto</h5>
<div class="outline-text-5" id="text-orge699ef1">
<ul class="org-ul">
<li>Dirige el proyecto.</li>
<li>Puede ser un analista experimentado.</li>
<li>Sabiduria en gestinar:
<ul class="org-ul">
<li>Equipos.</li>
<li>Tiempos.</li>
<li>Relacion con clientes.</li>
<li>Etc</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org762cffd" class="outline-5">
<h5 id="org762cffd">Analista del sistema</h5>
<div class="outline-text-5" id="text-org762cffd">
<ul class="org-ul">
<li>Tiene mucha experiencia.</li>
</ul>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdf9bb47" class="outline-2">
<h2 id="orgdf9bb47">TEMA 2</h2>
<div class="outline-text-2" id="text-orgdf9bb47">
<ul class="org-ul">
<li>&#x2026;</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Autor: Alberto Robles Gomez</p>
<p class="date">Created: 2022-05-11 Wed 11:07</p>
</div>
</body>
</html>
